Tekla Open API Reference for Tekla Structures 2025
WpfSaveLoad.HelpUrl Property
 Gets or sets the HelpUrl where the help file is located. If you do not provide a HelpUrl, the Tekla Structures help viewer will be displayed with given HelpKeyword.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string HelpUrl { get; set; }
Public Property HelpUrl As String
	Get
	Set
Property Value
Type: String
See Also
Reference
WpfSaveLoad Class
Tekla.Structures.Dialog.UIControls Namespace